# 1. Проверить, установлен ли пакет pillow в глобальном окружении.
# Если да — зафиксировать версию.
# Установить самую свежую версию pillow, если ранее она не была установлена.
# Сделать подтверждающий скриншот. Создать и активировать виртуальное окружение.
# Убедиться, что в нем нет пакета pillow. Сделать подтверждающий скриншот.
# Установить в виртуальное окружение pillow версии 6. Сделать подтверждающий скриншот.
# Деактивировать виртуальное окружение. Сделать подтверждающий скриншот.
# Скрины нумеровать двухразрядными числами, например: «01.jpg», «02.jpg».


