#4. * (вместо задачи 3) Написать функцию thesaurus_adv(), принимающую в качестве аргументов строки
#в формате «Имя Фамилия» и возвращающую словарь, в котором ключи — первые буквы фамилий,
#а значения — словари, реализованные по схеме предыдущего задания и содержащие записи,
#в которых фамилия начинается с соответствующей буквы. Например:
#>>> >>> thesaurus_adv("Иван Сергеев", "Инна Серова", "Петр Алексеев", "Илья Иванов", "Анна Савельева")
#Сможете ли вы вернуть отсортированный по ключам словарь?

thesaurus_adv =
{
    "А": {
        "П": "Петр Алексеев"
    },
    "С": {
        "И": ["Иван Сергеев", "Инна Серова"],
        "А": ["Анна Савельева"]
    }
}
